src/test/testtool/RaadpleegMetBurgerservicenummer/05/response.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Body><BG:npsLa01 xmlns:BG="http://www.egem.nl/StUF/sector/bg/0310" xmlns:StUF="http://www.egem.nl/StUF/StUF0301" xmlns:gml="http://www.opengis.net/gml" xmlns:ns="http://www.egem.nl/StUF/sector/bg/0310" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xlink="http://www.w3.org/1999/xlink" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<BG:stuurgegevens>
		<StUF:berichtcode>La01</StUF:berichtcode>
		<StUF:zender>
			<organisatie xmlns="http://www.egem.nl/StUF/StUF0301">NEDGR</organisatie>
			<applicatie xmlns="http://www.egem.nl/StUF/StUF0301">NEDMAG_VnA</applicatie>
		</StUF:zender>
		<StUF:ontvanger>
			<organisatie xmlns="http://www.egem.nl/StUF/StUF0301">0518</organisatie>
			<applicatie xmlns="http://www.egem.nl/StUF/StUF0301">PGAx-SG-ZVH</applicatie>
		</StUF:ontvanger>
		<StUF:tijdstipBericht>20241015055522843</StUF:tijdstipBericht>
		<StUF:crossRefnummer>d5b9cd54-30cb-47c9-97f9-8f41b1314272</StUF:crossRefnummer>
		<StUF:entiteittype>NPS</StUF:entiteittype>
	</BG:stuurgegevens>
	<BG:parameters>
		<StUF:indicatorVervolgvraag>false</StUF:indicatorVervolgvraag>
		<StUF:indicatorAfnemerIndicatie>false</StUF:indicatorAfnemerIndicatie>
		<StUF:aantalVoorkomens>1</StUF:aantalVoorkomens>
	</BG:parameters>
	<BG:antwoord>
		<BG:object StUF:entiteittype="NPS">
			<inp.bsn xmlns="http://www.egem.nl/StUF/sector/bg/0310">555555021</inp.bsn>
			<inp.a-nummer xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<geslachtsnaam xmlns="http://www.egem.nl/StUF/sector/bg/0310">Verhuistest</geslachtsnaam>
			<voorvoegselGeslachtsnaam xmlns="http://www.egem.nl/StUF/sector/bg/0310">van den</voorvoegselGeslachtsnaam>
			<voorletters xmlns="http://www.egem.nl/StUF/sector/bg/0310">K.</voorletters>
			<voornamen xmlns="http://www.egem.nl/StUF/sector/bg/0310">Kees</voornamen>
			<aanduidingNaamgebruik xmlns="http://www.egem.nl/StUF/sector/bg/0310">E</aanduidingNaamgebruik>
			<geslachtsnaamPartner xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<geslachtsaanduiding xmlns="http://www.egem.nl/StUF/sector/bg/0310">M</geslachtsaanduiding>
			<geboortedatum xmlns="http://www.egem.nl/StUF/sector/bg/0310">20020701</geboortedatum>
			<inp.geboorteplaats xmlns="http://www.egem.nl/StUF/sector/bg/0310">Hellevoetsluis</inp.geboorteplaats>
			<inp.geboorteLand xmlns="http://www.egem.nl/StUF/sector/bg/0310">6030</inp.geboorteLand>
			<overlijdensdatum xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<inp.overlijdenplaats xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<inp.overlijdenLand xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<verblijfsadres xmlns="http://www.egem.nl/StUF/sector/bg/0310">
				<aoa.identificatie>0518010001756246</aoa.identificatie>
				<wpl.identificatie xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
				<wpl.woonplaatsNaam>'s-Gravenhage</wpl.woonplaatsNaam>
				<aoa.woonplaatsWaarinGelegen>
					<wpl.identificatie xsi:nil="true" StUF:noValue="waardeOnbekend"/>
					<wpl.woonplaatsNaam xsi:nil="true" StUF:noValue="waardeOnbekend"/>
				</aoa.woonplaatsWaarinGelegen>
				<gor.identificatie xsi:nil="true" StUF:noValue="waardeOnbekend"/>
				<opr.identificatie xsi:nil="true" StUF:noValue="waardeOnbekend"/>
				<gor.openbareRuimteNaam xsi:nil="true" StUF:noValue="waardeOnbekend"/>
				<gor.straatnaam>Burg Waldeckstraat</gor.straatnaam>
				<aoa.postcode>2552TS</aoa.postcode>
				<aoa.huisnummer>1</aoa.huisnummer>
				<aoa.huisletter xsi:nil="true" StUF:noValue="waardeOnbekend"/>
				<aoa.huisnummertoevoeging>BIS</aoa.huisnummertoevoeging>
				<inp.locatiebeschrijving xsi:nil="true" StUF:noValue="waardeOnbekend"/>
				<begindatumVerblijf>20150808</begindatumVerblijf>
			</verblijfsadres>
			<inp.adresHerkomst xmlns="http://www.egem.nl/StUF/sector/bg/0310">W</inp.adresHerkomst>
			<inp.burgerlijkeStaat xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<inp.gemeenteVanInschrijving xmlns="http://www.egem.nl/StUF/sector/bg/0310">0518</inp.gemeenteVanInschrijving>
			<inp.datumInschrijving xmlns="http://www.egem.nl/StUF/sector/bg/0310">20020702</inp.datumInschrijving>
			<inp.indicatieGeheim xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<inp.heeftAlsNationaliteit StUF:entiteittype="NPSNAT" xmlns="http://www.egem.nl/StUF/sector/bg/0310">
				<gerelateerde StUF:entiteittype="NAT">
					<code xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
					<omschrijving xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
				</gerelateerde>
				<inp.redenVerkrijging>017</inp.redenVerkrijging>
				<inp.datumVerkrijging>20020701</inp.datumVerkrijging>
			</inp.heeftAlsNationaliteit>
		</BG:object>
	</BG:antwoord>
</BG:npsLa01></soapenv:Body></soapenv:Envelope>